

HELP_MESSAGE = """

🌱 Что я умею?

⚪️ Старт ( /start ):  Начать общение со мной.
⚪️ Меню ( /menu ): 🏠 Вернуться в главное меню.
⚪️ Подписка ( /tariffs ): ❤️ Узнать о доступных подписках.
⚪️ Баланс ( /balance ): 💰 Проверить свой баланс.
⚪️ Статистика ( /stats ): 📊 Посмотреть статистику использования бота.
⚪️ Новый диалог ( /new ): 🗑 Начать новый диалог.
⚪️ Повторить ( /retry ): 🔄 Сгенерировать последний ответ заново.
⚪️ Отмена ( /cancel ): ⛔️ Завершить обработку запроса.

❓ Нужна помощь? Напиши  /help, и я с удовольствием помогу!  😊

Для того чтобы получить ответ от бота, напиши сообщение, скинь файл, отправь видео (помни, \
видео должно быть не длительнее минуты) или фото и бот с радостью ответит вам! 

🌱 Хочешь узнать секреты здорового сада? 🌿  

❓ Задай мне вопрос!  Например, как ухаживать за любимым растением,  как сделать почву плодороднее  или как \
справиться с вредителями. 🐛 

💡 Чем больше информации ты предоставишь, тем точнее я смогу тебе помочь.  

😊  Если нужен общий совет, просто скажи об этом!

Следи за балансом токенов, чтобы бот мог ответить вам, но если токены закончатся - не беда! Вы можете приобрести их в \
разделе Подписка ( /tariffs )  😊.

Если бот не работает, не отвечает на вопросы, или не проходит оплата, \
Вы можете обратиться в нашу дружелюбную техническую поддержку 🛠️

"""

HELP_GROUP_CHAT_MESSAGE = """🌟 Хотите добавить уникального профессионального чат-бота агронома в свой чат? Вот как:

⚪️ Добавьте бота в групповой чат.
⚪️ Предоставьте ему права администратора для просмотра сообщений (другие права могут быть ограничены).
⚪️ Вы сделали свой групповой чат лучше!
⚪️ Чтобы получить ответ от бота в чате, просто упомяните его, написав @ или <b>ответьте</b> на его сообщение.

Например: "{имя_бота}, как вылечить табак от табачной мозаики?"
"""

ADMIN_HELP_MESSAGE = """
🌱 Вот мой расширенный админский функционал:

⚪️ Старт ( /start ):  Начать общение со мной.
⚪️ Меню ( /menu ): 🏠 Вернуться в главное меню.
⚪️ Тарифы ( /tariffs ): ⚙️  Изменить настройки тарифов.
⚪️ Статистика ( /stats ): 📊 Посмотреть статистику.
⚪️ Знания ( /knowledge ): 🧠 Добавить новые знания в базу.
⚪️ Уведомления ( /notify ): 📩 Отправить уведомление всем пользователям.
⚪️ Партнеры ( /partner ): 🤝  Управлять партнерами.
⚪️ Новый диалог ( /new ): 🗑 Начать новый диалог.
⚪️ Повторить ( /retry ): 🔄 Сгенерировать последний ответ заново.
⚪️ Отмена ( /cancel ): ⛔️ Завершить обработку запроса.

❓ Нужна помощь? Напиши  /help, и я с удовольствием помогу!  😊
"""

ADMIN_MENU_TEXT = """
<b>🏠 Главное меню администратора</b> 

Добро пожаловать в панель управления ботом! 

Вот что ты можешь сделать:

⚪️ ⚙️  Конфигуратор Тарифов:  Настроить и управлять тарифами вашего бота.
⚪️ 📊  Статистика:   Просмотреть подробную статистику работы бота.
⚪️ 🧠  Добавить знания:  Расширить знания бота, чтобы он мог отвечать на большее количество вопросов.
⚪️ 📩 Отправить сообщение всем пользователям:  Отправить важное сообщение всем пользователям вашего бота.
⚪️ 🤝 Партнеры:  Управлять партнерами вашего бота.
⚪️ ❓ Помощь:  Получить помощь по работе с ботом.
⚪️ 🗑 Новый диалог:  Начать новый разговор с ботом.
"""

MENU_TEXT = """
<b>👋  Добро пожаловать в меню! </b> 

Здесь ты можешь:

⚪️ ❤  Подписка:  Узнать о доступных вариантах подписки и оформить ее.
⚪️ 💰  Баланс:  Проверить свой текущий баланс.
⚪️ 📊  Статистика:  Посмотреть статистику использования бота.
⚪️ 🗑  Новый диалог:  Начать новый разговор с ботом.
⚪️ ❓  Помощь:  Получить помощь по работе с ботом.
⚪️ 📄  Оферта:  Просмотреть условия предоставления услуг.
"""

ADMIN_RATE_TEXT = """
<b>👋 Привет!  Добро пожаловать в конфигуратор тарифов!  Здесь ты можешь создавать, редактировать и  \
отслеживать все тарифы твоего бота.</b>  

Как пользоваться конфигуратором?

1. Просмотр тарифов:  
   ⚪️ В конфигураторе ты увидишь список всех доступных тарифов.
   ⚪️ Используй кнопки  ➡️ / ⬅️  для перехода между страницами, если тарифов много.
2. Редактирование тарифов:
   ⚪️ Нажми на название любого тарифа, чтобы открыть его настройки.
   ⚪️ Измени название, описание, цену и другие параметры тарифа по своему усмотрению.
3. Добавление нового тарифа:
   ⚪️ Нажми на кнопку  ➕ Добавить Тариф.
   ⚪️ Введи уникальное название, а также все остальные опции для нового тарифа.
4. Возврат в меню:
   ⚪️  Нажми на кнопку  ⬅️Назад в меню, чтобы вернуться в главное меню администратора.

Дополнительные советы:

⚪️  Убедись, что названия тарифов уникальные.
⚪️  В описании тарифов подробно расскажи о его преимуществах.
⚪️  Настраивай тарифы так, чтобы они были максимально удобными для твоих пользователей.

Удачи с настройкой тарифов!  😊
"""

RATE_TEXT = """
<b>💎  Выбор тарифа </b>

Подписка на бота даёт вам больше возможностей для работы с искусственным интеллектом!

<b>Вы получите:</b>

⚪️ 🚀  Увеличенное время генерации голоса и транскрипции:  Создавайте больше аудиоконтента без ограничений! 
⚪️ 🧠  Дополнительные токены для нейросети: Получайте больше ответов на ваши важные вопросы.

<b>Важно!</b> 

⚪️ По окончании выбранного периода подписки автоматически возобновляется подписка на тот же тариф. 
⚪️ Абонентская плата взимается автоматически  в начале каждого периода, если не отменена подписка.

<b>Доступные тарифы:</b>
"""

ADMIN_ADD_KNOWLEDGE_TEXT = """
<b>🧠 Добавление новых знаний для бота</b>

Есть три варианта добавления знаний:
⚪️ Добавление знаний через видео или плейлист на ютубе.
⚪️ Добавление знаний через общедоступные папку или отдельный файл на Гугл Диске.
⚪️ Добавление знаний через файл отправленный боту в телеграме.

<b>Выберите вариант работы ниже:</b>
"""

ADD_SUBSCRIBE = """
<b>😔  Упс! У вас закончились ресурсы! </b>

<b>Хотите продолжить общение с ботом?  </b>

<b>Попробуйте наши тарифы!</b>

<b>🔥 Вы получите:</b>

⚪️ 🚀  Увеличенное время генерации голоса и транскрипции:  Создавайте больше аудиоконтента без ограничений! 
⚪️ 🧠  Дополнительные токены для нейросети: Получайте больше ответов на ваши важные вопросы.

<b>Выбирайте подходящий тариф:</b>
"""
